verilog_defaults -push
verilog_defaults -add -defer
read_verilog -I/home/micko/src/litex/litex-boards/litex_boards/targets /home/micko/src/litex/litex-boards/litex_boards/targets/femtorv32_quark.v
read_verilog -I/home/micko/src/litex/litex-boards/litex_boards/targets /home/micko/src/litex/litex-boards/litex_boards/targets/build/colognechip_gatemate_evb/gateware/colognechip_gatemate_evb.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_gatemate -nomx8  -top colognechip_gatemate_evb
write_verilog  colognechip_gatemate_evb_synth.v