verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/micko/src/litex/litex-boards/litex_boards/targets/build/olimex_gatemate_a1_evb/gateware/core.v
read_verilog /home/micko/src/litex/litex-boards/litex_boards/targets/build/olimex_gatemate_a1_evb/gateware/olimex_gatemate_a1_evb.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0
hierarchy -top olimex_gatemate_a1_evb
setattr -unset ram_style a:ram_style=distributed
synth_gatemate -luttree -nomx8 -top olimex_gatemate_a1_evb
write_json  olimex_gatemate_a1_evb.json